<h1 id="tocheading">Table of Contents</h1>
<div id="toc"></div>

In [1]:
%%javascript
$.getScript('https://kmahelona.github.io/ipython_notebook_goodies/ipython_notebook_toc.js')

### 262. Trips and Users

The Trips table holds all taxi trips. Each trip has a unique Id, while Client_Id and Driver_Id are both foreign keys to the Users_Id at the Users table. Status is an ENUM type of (‘completed’, ‘cancelled_by_driver’, ‘cancelled_by_client’).
+----+-----------+-----------+---------+--------------------+----------+
| Id | Client_Id | Driver_Id | City_Id |        Status      |Request_at|
+----+-----------+-----------+---------+--------------------+----------+
| 1  |     1     |    10     |    1    |     completed      |2013-10-01|
| 2  |     2     |    11     |    1    | cancelled_by_driver|2013-10-01|
| 3  |     3     |    12     |    6    |     completed      |2013-10-01|
| 4  |     4     |    13     |    6    | cancelled_by_client|2013-10-01|
| 5  |     1     |    10     |    1    |     completed      |2013-10-02|
| 6  |     2     |    11     |    6    |     completed      |2013-10-02|
| 7  |     3     |    12     |    6    |     completed      |2013-10-02|
| 8  |     2     |    12     |    12   |     completed      |2013-10-03|
| 9  |     3     |    10     |    12   |     completed      |2013-10-03| 
| 10 |     4     |    13     |    12   | cancelled_by_driver|2013-10-03|
+----+-----------+-----------+---------+--------------------+----------+

The Users table holds all users. Each user has an unique Users_Id, and Role is an ENUM type of (‘client’, ‘driver’, ‘partner’).
+----------+--------+--------+
| Users_Id | Banned |  Role  |
+----------+--------+--------+
|    1     |   No   | client |
|    2     |   Yes  | client |
|    3     |   No   | client |
|    4     |   No   | client |
|    10    |   No   | driver |
|    11    |   No   | driver |
|    12    |   No   | driver |
|    13    |   No   | driver |
+----------+--------+--------+

Write a SQL query to find the cancellation rate of requests made by unbanned users (both client and driver must be unbanned) between Oct 1, 2013 and Oct 3, 2013. The cancellation rate is computed by dividing the number of canceled (by client or driver) requests made by unbanned users by the total number of requests made by unbanned users.

For the above tables, your SQL query should return the following rows with the cancellation rate being rounded to two decimal places.
+------------+-------------------+
|     Day    | Cancellation Rate |
+------------+-------------------+
| 2013-10-01 |       0.33        |
| 2013-10-02 |       0.00        |
| 2013-10-03 |       0.50        |
+------------+-------------------+

```mysql
SELECT request_at AS Day, round(sum(cancelled)/count(client_id), 2) AS "Cancellation Rate"
FROM (
    SELECT client_id, request_at,
        CASE WHEN status='completed' THEN 0
        ELSE 1 END as cancelled
    FROM trips
    JOIN users ON trips.client_id=users.users_id AND users.banned='No'
    WHERE request_at BETWEEN "2013-10-01" AND "2013-10-03"
        AND role='client') A
GROUP BY request_at

/*SELECT
	Trips.Request_at AS Day,
	CONVERT (
		SUM( CASE WHEN Trips.STATUS LIKE 'cancelled_by_%' THEN 1 ELSE 0 END ) / COUNT( * ),
		DECIMAL ( 10, 2 ) 
	) AS `Cancellation Rate`
FROM
	Trips 
WHERE
	Trips.Client_Id NOT IN ( SELECT Users_Id FROM Users WHERE Banned = 'Yes' AND Role = 'client' ) 
	AND Trips.Driver_Id NOT IN ( SELECT Users_Id FROM Users WHERE Banned = 'Yes' AND Role = 'driver' )
    AND Trips.Request_at BETWEEN '2013-10-01' AND '2013-10-03'
GROUP BY
	Request_at*/
```

### 511. Game Play Analysis I

Table: Activity
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key of this table.
This table shows the activity of players of some game.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.

Write an SQL query that reports the first login date for each player.
The query result format is in the following example:
Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+

Result table:
+-----------+-------------+
| player_id | first_login |
+-----------+-------------+
| 1         | 2016-03-01  |
| 2         | 2017-06-25  |
| 3         | 2016-03-02  |
+-----------+-------------+

```mysql
SELECT player_id, MIN(event_date) AS first_login
FROM activity
GROUP BY player_id
```

### 512. Game Play Analysis II

Table: Activity
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key of this table.
This table shows the activity of players of some game.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.

Write a SQL query that reports the device that is first logged in for each player.
The query result format is in the following example:
Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+

Result table:
+-----------+-----------+
| player_id | device_id |
+-----------+-----------+
| 1         | 2         |
| 2         | 3         |
| 3         | 1         |
+-----------+-----------+

```mysql
-- MYSQL
/*SELECT  a.player_id, device_id
FROM activity a
JOIN (
    SELECT player_id, MIN(event_date) as first_login
    FROM activity
    GROUP BY player_id
) b
ON a.player_id=b.player_id AND event_date=first_login*/

SELECT  player_id, device_id
FROM activity
WHERE (player_id, event_date) IN (
    SELECT player_id, MIN(event_date) as login
    FROM activity
    GROUP BY player_id
)

-- SQL server
SELECT  player_id, device_id
FROM (
    SELECT player_id, device_id,
    RANK() OVER (PARTITION BY player_id ORDER BY event_date) as login_no
    FROM activity
) x
WHERE login_no=1
```

### 534. Game Play Analysis III

Table: Activity
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key of this table.
This table shows the activity of players of some game.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.

Write an SQL query that reports for each player and date, how many games played so far by the player. That is, the total number of games played by the player until that date. Check the example for clarity.
The query result format is in the following example:
Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 1         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+

Result table:
+-----------+------------+---------------------+
| player_id | event_date | games_played_so_far |
+-----------+------------+---------------------+
| 1         | 2016-03-01 | 5                   |
| 1         | 2016-05-02 | 11                  |
| 1         | 2017-06-25 | 12                  |
| 3         | 2016-03-02 | 0                   |
| 3         | 2018-07-03 | 5                   |
+-----------+------------+---------------------+
For the player with id 1, 5 + 6 = 11 games played by 2016-05-02, and 5 + 6 + 1 = 12 games played by 2017-06-25.
For the player with id 3, 0 + 5 = 5 games played by 2018-07-03.
Note that for each player we only care about the days when the player logged in.

```mysql
-- MYSQL
/*SELECT a.player_id, a.event_date, sum(b.games_played) AS games_played_so_far 
FROM activity a
JOIN activity b
WHERE a.event_date>=b.event_date AND a.player_id=b.player_id
GROUP BY a.player_id, a.event_date*/

select a1.player_id, a1.event_date, sum(a2.games_played) games_played_so_far
from Activity a1, Activity a2
where a1.event_date >= a2.event_date
and a1.player_id = a2.player_id
group by a1.player_id, a1.event_date

-- SQL server
SELECT player_id, event_date,
    SUM(games_played) OVER (PARTITION BY player_id ORDER BY event_date) AS games_played_so_far
FROM activity
```

### 550. Game Play Analysis IV

Table: Activity
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key of this table.
This table shows the activity of players of some game.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.

Write an SQL query that reports the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places. In other words, you need to count the number of players that logged in for at least two consecutive days starting from their first login date, then divide that number by the total number of players.
The query result format is in the following example:
Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-03-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+

Result table:
+-----------+
| fraction  |
+-----------+
| 0.33      |
+-----------+
Only the player with id 1 logged back in after the first day he had logged in so the answer is 1/3 = 0.33

```mysql
-- MYSQL
/* SELECT ROUND(COUNT(a.player_id)/(SELECT COUNT(DISTINCT player_id) FROM activity), 2) AS fraction
FROM activity a
JOIN (
    SELECT player_id, MIN(event_date) AS first_login
    FROM activity
    GROUP BY player_id) b
ON a.player_id=b.player_id AND DATEDIFF(a.event_date, first_login)=1 */

SELECT ROUND(SUM(
    CASE WHEN a.first_login +1 = a2.event_date THEN 1 ELSE 0 END)
             / COUNT(DISTINCT a.player_id),2) AS fraction
FROM (
    SELECT player_id, MIN(event_date) AS first_login
    FROM activity
    GROUP BY player_id) a
JOIN activity a2
ON a.player_id=a2.player_id

-- SQL server
SELECT ROUND( COUNT(DISTINCT player_id)*1.0 / (SELECT COUNT(DISTINCT player_id) FROM activity), 2) AS fraction
FROM (
    SELECT player_id, event_date,
    DATEDIFF(day, LAG(event_date, 1) OVER (PARTITION BY player_id ORDER BY event_date), event_date) AS diff,
    RANK() OVER (PARTITION BY player_id ORDER BY event_date) AS rnk
    FROM activity
    ) x
WHERE diff=1 AND rnk=2
```

### 569. Median Employee Salary

The Employee table holds all employees. The employee table has three columns: Employee Id, Company Name, and Salary.
+-----+------------+--------+
|Id   | Company    | Salary |
+-----+------------+--------+
|1    | A          | 2341   |
|2    | A          | 341    |
|3    | A          | 15     |
|4    | A          | 15314  |
|5    | A          | 451    |
|6    | A          | 513    |
|7    | B          | 15     |
|8    | B          | 13     |
|9    | B          | 1154   |
|10   | B          | 1345   |
|11   | B          | 1221   |
|12   | B          | 234    |
|13   | C          | 2345   |
|14   | C          | 2645   |
|15   | C          | 2645   |
|16   | C          | 2652   |
|17   | C          | 65     |
+-----+------------+--------+

Write a SQL query to find the median salary of each company. Bonus points if you can solve it without using any built-in SQL functions.
+-----+------------+--------+
|Id   | Company    | Salary |
+-----+------------+--------+
|5    | A          | 451    |
|6    | A          | 513    |
|12   | B          | 234    |
|9    | B          | 1154   |
|14   | C          | 2645   |
+-----+------------+--------+

```mysql
-- MYSQL
SELECT
    Employee.Id, Employee.Company, Employee.Salary
FROM
    Employee,
    Employee alias
WHERE
    Employee.Company = alias.Company
GROUP BY Employee.Company , Employee.Salary
HAVING SUM(
    CASE WHEN Employee.Salary = alias.Salary THEN 1
    ELSE 0 END)
    >= ABS(SUM(SIGN(Employee.Salary - alias.Salary)))
ORDER BY Employee.Id

-- SQL server
SELECT id, company, salary
FROM (
    SELECT id, company, salary,
        COUNT(*) OVER (PARTITION BY company) as num_employee,
        ROW_NUMBER() OVER (PARTITION BY company ORDER BY salary) as seq_employee
    FROM employee) AS x
WHERE seq_employee IN (CEILING((num_employee+1)/2.0), FLOOR((num_employee+1)/2.0))
```

### 570. Managers with at Least 5 Direct Reports

The Employee table holds all employees including their managers. Every employee has an Id, and there is also a column for the manager Id.
+------+----------+-----------+----------+
|Id    |Name 	  |Department |ManagerId |
+------+----------+-----------+----------+
|101   |John 	  |A 	      |null      |
|102   |Dan 	  |A 	      |101       |
|103   |James 	  |A 	      |101       |
|104   |Amy 	  |A 	      |101       |
|105   |Anne 	  |A 	      |101       |
|106   |Ron 	  |B 	      |101       |
+------+----------+-----------+----------+

Given the Employee table, write a SQL query that finds out managers with at least 5 direct report. For the above table, your SQL query should return:
+-------+
| Name  |
+-------+
| John  |
+-------+
Note: No one would report to himself.

```mysql
SELECT name
FROM employee
WHERE Id IN (
    SELECT managerId
    FROM employee
    GROUP BY managerId
    HAVING count(*)>=5)
```

### 571. Find Median Given Frequency of Numbers

The Numbers table keeps the value of number and its frequency.
+----------+-------------+
|  Number  |  Frequency  |
+----------+-------------|
|  0       |  7          |
|  1       |  1          |
|  2       |  3          |
|  3       |  1          |
+----------+-------------+

In this table, the numbers are 0, 0, 0, 0, 0, 0, 0, 1, 2, 2, 2, 3, so the median is (0 + 0) / 2 = 0.
+--------+
| median |
+--------|
| 0.0000 |
+--------+
Write a query to find the median of all numbers and name the result as median.

```mysql
-- MYSQL
SELECT AVG(median) AS 'median'
FROM (
    SELECT a.Number as median, a.Frequency
    FROM Numbers a, Numbers b
    GROUP BY a.Number
    HAVING
        a.Frequency >= abs(Sum(
            CASE WHEN a.Number-b.Number > 0 THEN 1 * b.Frequency
                WHEN a.Number=b.Number THEN 0
                ELSE -1 * b.Frequency
            END))
) X

-- SQL server
with temp as (
    select sum(frequency) over(order by number) as cum_total,
    (sum(frequency) over(order by number) - frequency) as cum_excluded,
    sum(frequency) over () total,
    number, frequency
    from Numbers)

select avg(cast(number as decimal(6,2))) as median
from temp
where (total/2.0) between cum_excluded and cum_total

/*
SELECT sum(number)/cast(count(number) AS float) as median
FROM (SELECT number, frequency,
    sum(frequency) OVER (ORDER BY number ROWS BETWEEN unbounded preceding AND current ROW) AS CUM_NUM_high,
    sum(frequency) OVER (ORDER BY number ROWS BETWEEN unbounded preceding AND 1 preceding) AS CUM_NUM_low
FROM Numbers) AS X
WHERE (SELECT sum(frequency)/2.0 FROM numbers) BETWEEN coalesce(cum_num_low, 0) AND cum_num_high
*/
```

### 574. Winning Candidate

Table: Candidate
+-----+---------+
| id  | Name    |
+-----+---------+
| 1   | A       |
| 2   | B       |
| 3   | C       |
| 4   | D       |
| 5   | E       |
+-----+---------+  

Table: Vote
+-----+--------------+
| id  | CandidateId  |
+-----+--------------+
| 1   |     2        |
| 2   |     4        |
| 3   |     3        |
| 4   |     2        |
| 5   |     5        |
+-----+--------------+

id is the auto-increment primary key,
CandidateId is the id appeared in Candidate table.
Write a sql to find the name of the winning candidate, the above example will return the winner B.
+------+
| Name |
+------+
| B    |
+------+

Notes: You may assume there is no tie, in other words there will be only one winning candidate

```mysql
-- MYSQL
SELECT name
FROM candidate
JOIN vote
ON vote.candidateid=candidate.id
GROUP BY candidate.id
HAVING  count(vote.id)=(
    SELECT MAX(votes)
    FROM (
        SELECT count(*) AS votes
        FROM candidate
        RIGHT JOIN vote
        ON vote.candidateid=candidate.id
        GROUP BY candidate.id
        ) X
    )

-- SQL server
SELECT C.Name
FROM Candidate C
JOIN (
    SELECT CandidateId, RANK() OVER (ORDER BY COUNT(CandidateId) desc) AS rnk
    FROM Vote
    GROUP BY CandidateId) Voting
    ON C.id = Voting.CandidateId
    WHERE Voting.rnk=1
```

### 577. Employee Bonus

Select all employee's name and bonus whose bonus is < 1000.
Table:Employee
+-------+--------+-----------+--------+
| empId |  name  | supervisor| salary |
+-------+--------+-----------+--------+
|   1   | John   |  3        | 1000   |
|   2   | Dan    |  3        | 2000   |
|   3   | Brad   |  null     | 4000   |
|   4   | Thomas |  3        | 4000   |
+-------+--------+-----------+--------+
empId is the primary key column for this table.

Table: Bonus
+-------+-------+
| empId | bonus |
+-------+-------+
| 2     | 500   |
| 4     | 2000  |
+-------+-------+
empId is the primary key column for this table.

Example ouput:
+-------+-------+
| name  | bonus |
+-------+-------+
| John  | null  |
| Dan   | 500   |
| Brad  | null  |
+-------+-------+

```mysql
SELECT name, bonus
FROM employee as a
LEFT JOIN bonus as b
ON a.empid=b.empid 
WHERE b.bonus<1000 OR b.bonus IS NULL
```

### 578. Get Highest Answer Rate Question

Get the highest answer rate question from a table survey_log with these columns: id, action, question_id, answer_id, q_num, timestamp.

id means user id; action has these kind of values: "show", "answer", "skip"; answer_id is not null when action column is "answer", while is null for "show" and "skip"; q_num is the numeral order of the question in current session.

Write a sql query to identify the question which has the highest answer rate.
Example:
Input:
+------+-----------+--------------+------------+-----------+------------+
| id   | action    | question_id  | answer_id  | q_num     | timestamp  |
+------+-----------+--------------+------------+-----------+------------+
| 5    | show      | 285          | null       | 1         | 123        |
| 5    | answer    | 285          | 124124     | 1         | 124        |
| 5    | show      | 369          | null       | 2         | 125        |
| 5    | skip      | 369          | null       | 2         | 126        |
+------+-----------+--------------+------------+-----------+------------+
Output:
+-------------+
| survey_log  |
+-------------+
|    285      |
+-------------+
Explanation:
question 285 has answer rate 1/1, while question 369 has 0/1 answer rate, so output 285.

```mysql
SELECT question_id as survey_log
FROM survey_log
GROUP BY question_id
HAVING (SUM(IF(action='answer',1,0))/COUNT(action))=(
    SELECT MAX(rate)
    FROM (
        SELECT SUM(IF(action='answer',1,0))/COUNT(action) as rate
        FROM survey_log
        GROUP BY question_id) X
    )

/*SELECT question_id as survey_log
FROM
(
    SELECT question_id,
         SUM(case when action="answer" THEN 1 ELSE 0 END) as num_answer,
        SUM(case when action="show" THEN 1 ELSE 0 END) as num_show 
    FROM survey_log
    GROUP BY question_id
) as tbl
ORDER BY (num_answer / (num_show+num_answer)) DESC
LIMIT 1*/
```

### 579. Find Cumulative Salary of an Employee

The Employee table holds the salary information in a year.

Write a SQL to get the cumulative sum of an employee's salary over a period of 3 months but exclude the most recent month.
The result should be displayed by 'Id' ascending, and then by 'Month' descending.
Example
Input
| Id | Month | Salary |
|----|-------|--------|
| 1  | 1     | 20     |
| 2  | 1     | 20     |
| 1  | 2     | 30     |
| 2  | 2     | 30     |
| 3  | 2     | 40     |
| 1  | 3     | 40     |
| 3  | 3     | 60     |
| 1  | 4     | 60     |
| 3  | 4     | 70     |

Output
| Id | Month | Salary |
|----|-------|--------|
| 1  | 3     | 90     |
| 1  | 2     | 50     |
| 1  | 1     | 20     |
| 2  | 1     | 20     |
| 3  | 3     | 100    |
| 3  | 2     | 40     |

```mysql
-- MYSQL
SELECT t1.id, t1.month, t1.salary
FROM (
    SELECT a1.id, b1.month, sum(a1.salary) as salary
    FROM employee a1, employee b1
    where a1.id=b1.id AND a1.month between b1.month-2 and b1.month
    group by a1.id, b1.month) t1
JOIN (
    SELECT id, max(month) as month
    FROM (SELECT a.id, b.month, sum(a.salary) as salary
    FROM employee a, employee b
    where a.id=b.id AND a.month between b.month-2 and b.month
    group by a.id, b.month) X
    group by id) t2
ON t1.id=t2.id AND t1.month!=t2.month
ORDER BY t1.id, t1.month DESC

-- SQL server
SELECT id, month, salary
FROM (
    SELECT id, month,
    SUM(Salary) OVER (PARTITION BY id ORDER BY month ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS salary,
    RANK() OVER (PARTITION BY id ORDER BY month DESC) as month_rank
    FROM employee
) AS X
WHERE month_rank!=1
ORDER BY id, month DESC

/* SELECT A.ID,A.MONTH,
    SUM(SALARY) over (PARTITION BY A.ID order by month ROWS BETWEEN 2 PRECEDING AND CURRENT ROW ) salary
FROM EMPLOYEE A
WHERE (A.ID, A.MONTH)
    NOT IN (SELECT ID,MAX(MONTH) FROM EMPLOYEE_INPUT GROUP BY ID)
ORDER BY A.ID,A.MONTH DESC*/
```

### 580. Count Student Number in Departments

A university uses 2 data tables, student and department, to store data about its students and the departments associated with each major.

Write a query to print the respective department name and number of students majoring in each department for all departments in the department table (even ones with no current students).
Sort your results by descending number of students; if two or more departments have the same number of students, then sort those departments alphabetically by department name.

The student is described as follow:
| Column Name  | Type      |
|--------------|-----------|
| student_id   | Integer   |
| student_name | String    |
| gender       | Character |
| dept_id      | Integer   |
where student_id is the student's ID number, student_name is the student's name, gender is their gender, and dept_id is the department ID associated with their declared major.

And the department table is described as below:
| Column Name | Type    |
|-------------|---------|
| dept_id     | Integer |
| dept_name   | String  |
where dept_id is the department's ID number and dept_name is the department name.

Here is an example input:
student table:
| student_id | student_name | gender | dept_id |
|------------|--------------|--------|---------|
| 1          | Jack         | M      | 1       |
| 2          | Jane         | F      | 1       |
| 3          | Mark         | M      | 2       |
department table:
| dept_id | dept_name   |
|---------|-------------|
| 1       | Engineering |
| 2       | Science     |
| 3       | Law         |

The Output should be:
| dept_name   | student_number |
|-------------|----------------|
| Engineering | 2              |
| Science     | 1              |
| Law         | 0              |

```mysql
SELECT dept_name, COUNT(student_name) as student_number
FROM department d
LEFT JOIN student s
ON d.dept_id=s.dept_id
GROUP BY d.dept_name
ORDER BY student_number DESC, d.dept_name
```